```
var.parent_domain
  domain assigned to the kubernetes cluster

  Enter a value: 
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.jx-requirements will be created
  + resource "local_file" "jx-requirements" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./jx-requirements.yaml"
      + id                   = (known after apply)
    }

  # module.jx.google_project_service.cloudbuild_api will be created
  + resource "google_project_service" "cloudbuild_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "cloudbuild.googleapis.com"
    }

  # module.jx.google_project_service.cloudresourcemanager_api will be created
  + resource "google_project_service" "cloudresourcemanager_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.jx.google_project_service.compute_api will be created
  + resource "google_project_service" "compute_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "compute.googleapis.com"
    }

  # module.jx.google_project_service.containeranalysis_api will be created
  + resource "google_project_service" "containeranalysis_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "containeranalysis.googleapis.com"
    }

  # module.jx.google_project_service.containerregistry_api will be created
  + resource "google_project_service" "containerregistry_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "containerregistry.googleapis.com"
    }

  # module.jx.google_project_service.iam_api will be created
  + resource "google_project_service" "iam_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "iam.googleapis.com"
    }

  # module.jx.module.backup.google_project_iam_member.velero_sa_storage_admin_binding will be created
  + resource "google_project_iam_member" "velero_sa_storage_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.admin"
    }

  # module.jx.module.backup.google_project_iam_member.velero_sa_storage_object_admin_binding will be created
  + resource "google_project_iam_member" "velero_sa_storage_object_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectAdmin"
    }

  # module.jx.module.backup.google_project_iam_member.velero_sa_storage_object_creator_binding will be created
  + resource "google_project_iam_member" "velero_sa_storage_object_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectCreator"
    }

  # module.jx.module.backup.google_service_account.velero_sa will be created
  + resource "google_service_account" "velero_sa" {
      + account_id   = "tf-pr-13-3-velero"
      + display_name = "Velero service account for tf-pr-13-3"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.jx.module.backup.google_storage_bucket.backup_bucket will be created
  + resource "google_storage_bucket" "backup_bucket" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + location           = "US"
      + name               = "terraform-test-261120-backup"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)
    }

  # module.jx.module.cluster.google_container_cluster.jx_cluster will be created
  + resource "google_container_cluster" "jx_cluster" {
      + additional_zones            = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + description                 = "jx k8s cluster"
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = true
      + enable_shielded_nodes       = false
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 3
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1-b"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "tf-pr-13-3"
      + network                     = "default"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + region                      = (known after apply)
      + resource_labels             = {
          + "type" = ""
        }
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
      + zone                        = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)
          + password               = (sensitive value)
          + username               = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.full_control",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + workload_identity_config {
          + identity_namespace = "terraform-test-261120.svc.id.goog"
        }
    }

  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_dns_admin_binding will be created
  + resource "google_project_iam_member" "jxboot_sa_dns_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/dns.admin"
    }

  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_project_viewer_binding will be created
  + resource "google_project_iam_member" "jxboot_sa_project_viewer_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/viewer"
    }

  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_service_account_key_binding will be created
  + resource "google_project_iam_member" "jxboot_sa_service_account_key_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountKeyAdmin"
    }

  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_storage_admin_binding will be created
  + resource "google_project_iam_member" "jxboot_sa_storage_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.admin"
    }

  # module.jx.module.cluster.google_project_iam_member.kaniko_sa_storage_admin_binding will be created
  + resource "google_project_iam_member" "kaniko_sa_storage_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.admin"
    }

  # module.jx.module.cluster.google_project_iam_member.kaniko_sa_storage_object_admin_binding will be created
  + resource "google_project_iam_member" "kaniko_sa_storage_object_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectAdmin"
    }

  # module.jx.module.cluster.google_project_iam_member.kaniko_sa_storage_object_creator_binding will be created
  + resource "google_project_iam_member" "kaniko_sa_storage_object_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectCreator"
    }

  # module.jx.module.cluster.google_service_account.jxboot_sa will be created
  + resource "google_service_account" "jxboot_sa" {
      + account_id   = "tf-pr-13-3-jb"
      + display_name = "jx-boot service account for tf-pr-13-3"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.jx.module.cluster.google_service_account.kaniko_sa will be created
  + resource "google_service_account" "kaniko_sa" {
      + account_id   = "tf-pr-13-3-ko"
      + display_name = "Kaniko service account for tf-pr-13-3"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.jx.module.cluster.google_service_account.storage_sa will be created
  + resource "google_service_account" "storage_sa" {
      + account_id   = "tf-pr-13-3-st"
      + display_name = "Storage service account for tf-pr-13-3"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.jx.module.cluster.google_service_account_iam_binding.jxboot_sa_workload_binding will be created
  + resource "google_service_account_iam_binding" "jxboot_sa_workload_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:terraform-test-261120.svc.id.goog[jx/tf-pr-13-3-jb]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.jx.module.cluster.google_service_account_iam_binding.kaniko_sa_workload_binding will be created
  + resource "google_service_account_iam_binding" "kaniko_sa_workload_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:terraform-test-261120.svc.id.goog[jx/tf-pr-13-3-ko]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.jx.module.cluster.google_storage_bucket.lts_bucket will be created
  + resource "google_storage_bucket" "lts_bucket" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + location           = "US"
      + name               = "terraform-test-261120-lts"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)
    }

  # module.jx.module.dns.google_project_iam_member.externaldns_sa_dns_admin_binding will be created
  + resource "google_project_iam_member" "externaldns_sa_dns_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/dns.admin"
    }

  # module.jx.module.dns.google_project_service.dns_api will be created
  + resource "google_project_service" "dns_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "dns.googleapis.com"
    }

  # module.jx.module.dns.google_service_account.externaldns_sa will be created
  + resource "google_service_account" "externaldns_sa" {
      + account_id   = "tf-pr-13-3-dn"
      + display_name = "ExternalDNS service account for tf-pr-13-3"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.jx.module.dns.google_service_account_iam_binding.externaldns_sa_workload_binding will be created
  + resource "google_service_account_iam_binding" "externaldns_sa_workload_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:terraform-test-261120.svc.id.goog[jx/tf-pr-13-3-dn]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.jx.module.vault.google_kms_crypto_key.vault_crypto_key will be created
  + resource "google_kms_crypto_key" "vault_crypto_key" {
      + id              = (known after apply)
      + key_ring        = (known after apply)
      + name            = "tf-pr-13-3-crypto-key"
      + purpose         = "ENCRYPT_DECRYPT"
      + rotation_period = "100000s"
      + self_link       = (known after apply)

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.jx.module.vault.google_kms_key_ring.vault_keyring will be created
  + resource "google_kms_key_ring" "vault_keyring" {
      + id        = (known after apply)
      + location  = "global"
      + name      = "tf-pr-13-3-keyring"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.jx.module.vault.google_project_iam_member.vault_sa_cloudkms_admin_binding will be created
  + resource "google_project_iam_member" "vault_sa_cloudkms_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudkms.admin"
    }

  # module.jx.module.vault.google_project_iam_member.vault_sa_cloudkms_crypto_binding will be created
  + resource "google_project_iam_member" "vault_sa_cloudkms_crypto_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.jx.module.vault.google_project_iam_member.vault_sa_storage_object_admin_binding will be created
  + resource "google_project_iam_member" "vault_sa_storage_object_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectAdmin"
    }

  # module.jx.module.vault.google_project_service.cloudkms_api will be created
  + resource "google_project_service" "cloudkms_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-test-261120"
      + service            = "cloudkms.googleapis.com"
    }

  # module.jx.module.vault.google_service_account.vault_sa will be created
  + resource "google_service_account" "vault_sa" {
      + account_id   = "tf-pr-13-3-vt"
      + display_name = "Vault service account for tf-pr-13-3"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.jx.module.vault.google_service_account_iam_binding.vault_sa_workload_binding will be created
  + resource "google_service_account_iam_binding" "vault_sa_workload_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:terraform-test-261120.svc.id.goog[jx/tf-pr-13-3-vt]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.jx.module.vault.google_storage_bucket.vault_bucket will be created
  + resource "google_storage_bucket" "vault_bucket" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + location           = "US"
      + name               = "terraform-test-261120-vault"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.